Aerodynamic_Module_GUI/ALMCase/source/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../0/include/initialConditions"

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         $EndTime;

deltaT          0.01;

writeControl    timeStep;

writeInterval   $WriteInterval;

writeFormat     binary;

writePrecision  7;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.1;

libs
(
    "libturbinesFoam.so"
);

/*functions
{
	#include "fieldAverage"
}*/












// ************************************************************************* //
