Aerodynamic_Module_GUI/ALMCase/source/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	/*
    (-9  -9 -4.5) // 0
    ( 18 -9 -4.5) // 1
    ( 18  9 -4.5) // 2
    (-9   9 -4.5) // 3
    (-9  -9 9) // 4
    ( 18 -9 9) // 5
    ( 18  9 9) // 6
    (-9   9 9) // 7
    */
    
    (-400	-400		-400) // 0
    ( 800	-400		-400) // 1
    ( 800	 400		-400) // 2
    (-400	 400		-400) // 3
    (-400	-400		 400) // 4
    ( 800	-400		 400) // 5
    ( 800	 400		 400) // 6
    (-400	 400		 400) // 7

);

blocks
(
    hex (0 1 2 3 4 5 6 7)
       (60 40  40)
    simpleGrading 
    (		
		(1 1 1)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
	type patch;
	faces
        (
            (1 2 6 5)
        );
    }

    walls
    {
	type slip;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }

    top
    {
	type slip;
	faces
        (
            (4 5 6 7)
        );
    }

    bottom
    {
	type slip; 
        faces
        (
            (0 1 2 3)
        );
    }
);

edges
(
);

mergePatchPairs
(
);

// ************************************************************************* //
