Aerodynamic_Module_GUI/ALMCase/source/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($WndVel 0 0);

boundaryField
{
    #include "include/fixedInlet"

    outlet
    {
        type        zeroGradient;
    }

    walls
    {
        type        slip;
    }

    top
    {
        type        slip;
    }

    bottom
    {
        type        slip;
    }

    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
