Aerodynamic_Module_GUI/ALMCase/source/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name 	turbine;
        type	cellSet;
        action	new;
        source	cylinderToCell;
        sourceInfo
        {
            type cylinder; 
            p1 (-5 0 0);
            p2 ( 5 0 0);
            radius 100; 
        }
    }

    {
        name    turbine;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set turbine;
        }
    }

    {
        name    wake;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            type	cylinder; 
	    p1 (-100 0 0);
	    p2 (200 0 0);
	    radius 150;
        }
    }
);

// ************************************************************************* //
